#coding=utf-8

#生成asset编号
idrange = range(0,11)

#生成asset名称
names_0 = [u'多因子-5因子开关平价规模5',
           u'单因子-波动率开关规模5',u'单因子-波动率开关规模1',
           u'单因子-大小盘开关规模5',u'单因子-大小盘开关规模1',
           u'单因子-BP开关规模5',u'单因子-BP开关规模1',
           u'单因子-交易量开关规模5',u'单因子-交易量开关规模1',
           u'单因子-持股集中度开关规模5',u'单因子-持股集中度开关规模1']

#使用因子
factorslist_33 = [['ln_capital','BP','std_3m','tradevolumn_3m','holder_avgpct'],
                  ['std_3m'],['std_3m'],['ln_capital'],['ln_capital'],
                  ['BP'],['BP'],['tradevolumn_3m'],['tradevolumn_3m'],
                  ['holder_avgpct'],['holder_avgpct']]

#基金池规模
kindslist_33 = [5,5,1,5,1,5,1,5,1,5,1]

#基金池保留倍数
holdlist_33 = [10,10,5,10,5,10,5,10,5,10,5]

#择时长短夏普相减参数
shyrperatios_42 = [0.75,0,0,1,1,1.1,1.1,1,1,0.5,0.5]

#择时shyrpe强弱判定倍数
trendratios_42 = [0.9,0.5,0.5,0.9,0.9,0.5,0.5,0.5,0.5,0.5,0.5]

#择时强弱是否延续
trendstables_42 = [0,1,1,0,0,1,1,0,0,1,1]

#择时回溯时期
periods_42 = [7,60,60,7,7,60,60,7,7,60,60]

#择时回溯信号天数要求
limitpcts_42 = [7,29,29,7,7,31,31,7,7,29,29]

#择时策略为趋势或反转
directs_42 = [1,0,0,1,1,0,0,1,1,1,1]

